
*** test goalify  
    
#+begin_src scheme :noweb yes :tangle /tmp/foo.rkt
  #lang racket/load 
  <<main>> 
  
  (require 'function_blocks)
  (require "var_and_sub.rkt")
  
  (new-var X)
  (new-var Y) 
  
  (define (one-of X L ) 
    (make-cond-G (make=:= X (car L) ) 
                 (make-and-G (make-not-G (make=:= (cdr L) '()))
                             (goalify (one-of X (cdr L)))
                             )))
  
  (let ([ R (run*simple (one-of X '(1 2 3)) (sub-comp (elem-sub X (empty))
                                       (empty-sub)))
            ])
    (printf "----------------------~n")
    (printf "~s~n" (map (lambda (Sub) (query X Sub))  R)))
  
  
#+end_src

#+RESULTS:
#+begin_example
G-list (#<procedure:/tmp/foo.rkt:98:10> #<procedure:/tmp/foo.rkt:174:27>)
"X"->|_|, ()
"X"->|_|, ()
(2 3)()
G-list (#<procedure:/tmp/foo.rkt:174:27>)
G-list (#<procedure:/tmp/foo.rkt:98:10> #<procedure:/tmp/foo.rkt:174:27>)
"X"->|_|, ()
"X"->|_|, ()
(3)()
G-list (#<procedure:/tmp/foo.rkt:174:27>)
G-list (#<procedure:/tmp/foo.rkt:98:10> #<procedure:/tmp/foo.rkt:174:27>)
"X"->|_|, ()
"X"->|_|, ()
----------------------
query for : #<Var>
 in :"X"->1, "X"->|_|, ()
query for : #<Var>
 in :"X"->2, "X"->|_|, ()
query for : #<Var>
 in :"X"->3, "X"->|_|, ()
(1 2 3)
#+end_example



** test 

   nur wegen module load paths mal in das source dir reintanglen 
   die load-language meshed nicht so gut mit dem was hier versucht wurde 
   wenn hier function blocks rein-ge-pastet wird als 
   (require 'function_blocks ) 
   und in macro_blocks 
   (require "function_blocks")
   sind das 2 verschiedene module und der ganze spass faellt auseinander 

#+begin_src scheme :noweb yes :tangle /tmp/foo.rkt
  #lang racket/load 
  
  <<main>> 
      
  (require 'function_blocks )
  (require "var_and_sub.rkt")
  
  (new-var X)
  (new-var Z)
  
  (define S (run*simple 
             (make-and-G
              (make=:= Z 5)
              (letq ([Y (+ (qry Z) 1 )])
                    (make=:= X Y)
                    ))
             (ext-s Z (empty) (ext-s X (empty) (empty-sub)))))
  
  (write (query X (car S )))
  
      
#+end_src

#+RESULTS:
: query for : #<Var>
:  in :"Z"->5, "Z"->|_|, "X"->|_|, ()
: query for : #<Var>
:  in :"X"->6, "lolq"->6, "Z"->5, "Z"->|_|, "X"->|_|, ()
: 6



